RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_interrupts.h
/**
 *******************************************************************************
 * @file  hc32f4a0_interrupts.h
 * @brief This file contains all the functions prototypes of the interrupt driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-08-25       Zhangxl         Modify for MISRAC2012-8.4
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_INTERRUPTS_H__
#define __HC32F4A0_INTERRUPTS_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_INTERRUPTS
 * @{
 */

#if (DDL_INTERRUPTS_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup INTC_Global_Types INTC Global Types
 * @{
 */
/**
 * @brief  Interrupt registration structure definition
 */
typedef struct
{
    en_int_src_t    enIntSrc;   /*!< Peripheral interrupt number, can be any value @ref en_int_src_t    */
    IRQn_Type       enIRQn;     /*!< Peripheral IRQ type, can be Int000_IRQn~Int127_IRQn @ref IRQn_Type */
    func_ptr_t      pfnCallback;/*!< Callback function for corresponding peripheral IRQ                 */
} stc_irq_signin_config_t;

/**
 * @brief  NMI initialize configuration structure definition
 */
typedef struct
{
    uint32_t    u32NmiSrc;      /*!< NMI trigger source, @ref NMI_TriggerSrc_Sel for details                */
    func_ptr_t  pfnNmiCallback; /*!< NMI Callback function pointers                                         */
}stc_nmi_init_t;

/**
 * @brief  EXINT initialize configuration structure definition
 */
typedef struct
{
    uint32_t    u32ExIntCh;     /*!< ExInt CH.0~15 @ref EXINT_Channel_Sel */
    uint32_t    u32ExIntFAE;    /*!< ExInt filter A function setting, @ref EXINT_FilterAClock_Sel for details */
    uint32_t    u32ExIntFAClk;  /*!< ExInt filter A clock division, @ref EXINT_FilterAClock_Div for details */
    uint32_t    u32ExIntFBE;    /*!< ExInt filter B function setting, @ref EXINT_FilterBClock_Sel for details*/
    uint32_t    u32ExIntFBTime; /*!< ExInt filter B time, @ref EXINT_FilterBTim_Sel for details*/
    uint32_t    u32ExIntLvl;    /*!< ExInt trigger edge, @ref EXINT_Trigger_Sel for details             */
}stc_exint_init_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup INTC_Global_Macros INTC Global Macros
 * @{
 */
/**
 * @defgroup INTC_DefaultPriority_Sel Interrupt default priority level
 * Possible values are 0 (high priority) to 15 (low priority)
 * @{
 */
#define DDL_IRQ_PRIORITY_DEFAULT    (15U)
/**
 * @}
 */

/**
 * @defgroup INTC_Priority_Sel Interrupt priority level 00 ~ 15
 * @{
 */
#define DDL_IRQ_PRIORITY_00         (0U)
#define DDL_IRQ_PRIORITY_01         (1U)
#define DDL_IRQ_PRIORITY_02         (2U)
#define DDL_IRQ_PRIORITY_03         (3U)
#define DDL_IRQ_PRIORITY_04         (4U)
#define DDL_IRQ_PRIORITY_05         (5U)
#define DDL_IRQ_PRIORITY_06         (6U)
#define DDL_IRQ_PRIORITY_07         (7U)
#define DDL_IRQ_PRIORITY_08         (8U)
#define DDL_IRQ_PRIORITY_09         (9U)
#define DDL_IRQ_PRIORITY_10         (10U)
#define DDL_IRQ_PRIORITY_11         (11U)
#define DDL_IRQ_PRIORITY_12         (12U)
#define DDL_IRQ_PRIORITY_13         (13U)
#define DDL_IRQ_PRIORITY_14         (14U)
#define DDL_IRQ_PRIORITY_15         (15U)
/**
 * @}
 */

/**
 * @defgroup INTC_Bit_mask definition Bit Mask
 * @{
 */
#define     BIT_MASK_00             (1UL << 0U)
#define     BIT_MASK_01             (1UL << 1U)
#define     BIT_MASK_02             (1UL << 2U)
#define     BIT_MASK_03             (1UL << 3U)
#define     BIT_MASK_04             (1UL << 4U)
#define     BIT_MASK_05             (1UL << 5U)
#define     BIT_MASK_06             (1UL << 6U)
#define     BIT_MASK_07             (1UL << 7U)
#define     BIT_MASK_08             (1UL << 8U)
#define     BIT_MASK_09             (1UL << 9U)
#define     BIT_MASK_10             (1UL << 10U)
#define     BIT_MASK_11             (1UL << 11U)
#define     BIT_MASK_12             (1UL << 12U)
#define     BIT_MASK_13             (1UL << 13U)
#define     BIT_MASK_14             (1UL << 14U)
#define     BIT_MASK_15             (1UL << 15U)
#define     BIT_MASK_16             (1UL << 16U)
#define     BIT_MASK_17             (1UL << 17U)
#define     BIT_MASK_18             (1UL << 18U)
#define     BIT_MASK_19             (1UL << 19U)
#define     BIT_MASK_20             (1UL << 20U)
#define     BIT_MASK_21             (1UL << 21U)
#define     BIT_MASK_22             (1UL << 22U)
#define     BIT_MASK_23             (1UL << 23U)
#define     BIT_MASK_24             (1UL << 24U)
#define     BIT_MASK_25             (1UL << 25U)
#define     BIT_MASK_26             (1UL << 26U)
#define     BIT_MASK_27             (1UL << 27U)
#define     BIT_MASK_28             (1UL << 28U)
#define     BIT_MASK_29             (1UL << 29U)
#define     BIT_MASK_30             (1UL << 30U)
#define     BIT_MASK_31             (1UL << 31U)
/**
 * @}
 */

/**
 * @defgroup NMI_TriggerSrc_Sel NMI trigger source selection
 * @{
 */
#define NMI_SRC_SWDT                (1UL << INTC_NMIFR_SWDTFR_POS)
#define NMI_SRC_PVD1                (1UL << INTC_NMIFR_PVD1FR_POS)
#define NMI_SRC_PVD2                (1UL << INTC_NMIFR_PVD2FR_POS)
#define NMI_SRC_XTAL                (1UL << INTC_NMIFR_XTALSTPFR_POS)
#define NMI_SRC_SRAM_PARITY         (1UL << INTC_NMIFR_REPFR_POS)
#define NMI_SRC_SRAM_ECC            (1UL << INTC_NMIFR_RECCFR_POS)
#define NMI_SRC_BUS_ERR             (1UL << INTC_NMIFR_BUSMFR_POS)
#define NMI_SRC_WDT                 (1UL << INTC_NMIFR_WDTFR_POS)
#define NMI_SRC_MASK                (NMI_SRC_SWDT   | NMI_SRC_PVD1          |   \
                                    NMI_SRC_PVD2    | NMI_SRC_XTAL          |   \
                                    NMI_SRC_BUS_ERR | NMI_SRC_SRAM_PARITY   |   \
                                    NMI_SRC_WDT     | NMI_SRC_SRAM_ECC)
/**
 * @}
 */

/**
 * @defgroup NOCCR_Register_Msk Noise cancel register mask
 * @{
 */
#define INTC_NOCCR_MASK     (INTC_NOCCR_NOCSEL)

/**
 * @}
 */


/**
 * @defgroup MNI_Register_Msk NMI register mask
 * @{
 */
#define INTC_NMIENR_MASK    (INTC_NMIENR_SWDTENR | INTC_NMIENR_PVD1ENR      |   \
                            INTC_NMIENR_PVD2ENR | INTC_NMIENR_XTALSTPENR    |   \
                            INTC_NMIENR_REPENR  | INTC_NMIENR_RECCENR       |   \
                            INTC_NMIENR_BUSMENR | INTC_NMIENR_WDTENR)

#define INTC_NMIFR_MASK     (INTC_NMIFR_SWDTFR | INTC_NMIFR_PVD1FR          |   \
                            INTC_NMIFR_PVD2FR   | INTC_NMIFR_XTALSTPFR      |   \
                            INTC_NMIFR_REPFR    | INTC_NMIFR_RECCFR         |   \
                            INTC_NMIFR_BUSMFR   | INTC_NMIFR_WDTFR)

