RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_interrupts.h
void NMI_IrqHandler(void);
void HardFault_IrqHandler(void);
void MemManage_IrqHandler(void);
void BusFault_IrqHandler(void);
void UsageFault_IrqHandler(void);
void SVC_IrqHandler(void);
void DebugMon_IrqHandler(void);
void PendSV_IrqHandler(void);
void SysTick_IrqHandler(void);
void EXTINT_00_IrqHandler(void);
void EXTINT_01_IrqHandler(void);
void EXTINT_02_IrqHandler(void);
void EXTINT_03_IrqHandler(void);
void EXTINT_04_IrqHandler(void);
void EXTINT_05_IrqHandler(void);
void EXTINT_06_IrqHandler(void);
void EXTINT_07_IrqHandler(void);
void EXTINT_08_IrqHandler(void);
void EXTINT_09_IrqHandler(void);
void EXTINT_10_IrqHandler(void);
void EXTINT_11_IrqHandler(void);
void EXTINT_12_IrqHandler(void);
void EXTINT_13_IrqHandler(void);
void EXTINT_14_IrqHandler(void);
void EXTINT_15_IrqHandler(void);
void DMA_1_Tc0_IrqHandler(void);
void DMA_1_Tc1_IrqHandler(void);
void DMA_1_Tc2_IrqHandler(void);
void DMA_1_Tc3_IrqHandler(void);
void DMA_1_Tc4_IrqHandler(void);
void DMA_1_Tc5_IrqHandler(void);
void DMA_1_Tc6_IrqHandler(void);
void DMA_1_Tc7_IrqHandler(void);
void DMA_1_Btc0_IrqHandler(void);
void DMA_1_Btc1_IrqHandler(void);
void DMA_1_Btc2_IrqHandler(void);
void DMA_1_Btc3_IrqHandler(void);
void DMA_1_Btc4_IrqHandler(void);
void DMA_1_Btc5_IrqHandler(void);
void DMA_1_Btc6_IrqHandler(void);
void DMA_1_Btc7_IrqHandler(void);
void DMA_1_Err0_IrqHandler(void);
void DMA_1_Err1_IrqHandler(void);
void DMA_1_Err2_IrqHandler(void);
void DMA_1_Err3_IrqHandler(void);
void DMA_1_Err4_IrqHandler(void);
void DMA_1_Err5_IrqHandler(void);
void DMA_1_Err6_IrqHandler(void);
void DMA_1_Err7_IrqHandler(void);
void DMA_2_Tc0_IrqHandler(void);
void DMA_2_Tc1_IrqHandler(void);
void DMA_2_Tc2_IrqHandler(void);
void DMA_2_Tc3_IrqHandler(void);
void DMA_2_Tc4_IrqHandler(void);
void DMA_2_Tc5_IrqHandler(void);
void DMA_2_Tc6_IrqHandler(void);
void DMA_2_Tc7_IrqHandler(void);
void DMA_2_Btc0_IrqHandler(void);
void DMA_2_Btc1_IrqHandler(void);
void DMA_2_Btc2_IrqHandler(void);
void DMA_2_Btc3_IrqHandler(void);
void DMA_2_Btc4_IrqHandler(void);
void DMA_2_Btc5_IrqHandler(void);
void DMA_2_Btc6_IrqHandler(void);
void DMA_2_Btc7_IrqHandler(void);
void DMA_2_Err0_IrqHandler(void);
void DMA_2_Err1_IrqHandler(void);
void DMA_2_Err2_IrqHandler(void);
void DMA_2_Err3_IrqHandler(void);
void DMA_2_Err4_IrqHandler(void);
void DMA_2_Err5_IrqHandler(void);
void DMA_2_Err6_IrqHandler(void);
void DMA_2_Err7_IrqHandler(void);
void EFM_PgmEraseErr_IrqHandler(void);
void EFM_ColErr_IrqHandler(void);
void EFM_OpEnd_IrqHandler(void);
void QSPI_Err_IrqHandler(void);
void MAU_Sqrt_IrqHandler(void);
void DVP_FrameStart_IrqHandler(void);
void DVP_FrameEnd_IrqHandler(void);
void DVP_LineStart_IrqHandler(void);
void DVP_LineEnd_IrqHandler(void);
void DVP_SwSyncErr_IrqHandler(void);
void DVP_FifoErr_IrqHandler(void);
void FMAC_1_IrqHandler(void);
void FMAC_2_IrqHandler(void);
void FMAC_3_IrqHandler(void);
void FMAC_4_IrqHandler(void);
void DCU_1_IrqHandler(void);
void DCU_2_IrqHandler(void);
void DCU_3_IrqHandler(void);
void DCU_4_IrqHandler(void);
void DCU_5_IrqHandler(void);
void DCU_6_IrqHandler(void);
void DCU_7_IrqHandler(void);
void DCU_8_IrqHandler(void);
void TMR0_1_CmpA_IrqHandler(void);
void TMR0_1_CmpB_IrqHandler(void);
void TMR0_2_CmpA_IrqHandler(void);
void TMR0_2_CmpB_IrqHandler(void);
void TMR2_1_CmpA_IrqHandler(void);
void TMR2_1_CmpB_IrqHandler(void);
void TMR2_1_OvfA_IrqHandler(void);
void TMR2_1_OvfB_IrqHandler(void);
void TMR2_2_CmpA_IrqHandler(void);
void TMR2_2_CmpB_IrqHandler(void);
void TMR2_2_OvfA_IrqHandler(void);
void TMR2_2_OvfB_IrqHandler(void);
void TMR2_3_CmpA_IrqHandler(void);
void TMR2_3_CmpB_IrqHandler(void);
void TMR2_3_OvfA_IrqHandler(void);
void TMR2_3_OvfB_IrqHandler(void);
void TMR2_4_CmpA_IrqHandler(void);
void TMR2_4_CmpB_IrqHandler(void);
void TMR2_4_OvfA_IrqHandler(void);
void TMR2_4_OvfB_IrqHandler(void);
void RTC_TimeStamp0_IrqHandler(void);
void RTC_TimeStamp1_IrqHandler(void);
void RTC_Alarm_IrqHandler(void);
void RTC_Period_IrqHandler(void);
void CLK_XtalStop_IrqHandler(void);
void SWDT_IrqHandler(void);
void WDT_IrqHandler(void);
void PWC_WakeupTimer_IrqHandler(void);
void TMR6_1_GCmpA_IrqHandler(void);
void TMR6_1_GCmpB_IrqHandler(void);
void TMR6_1_GCmpC_IrqHandler(void);
void TMR6_1_GCmpD_IrqHandler(void);
void TMR6_1_GCmpE_IrqHandler(void);
void TMR6_1_GCmpF_IrqHandler(void);
void TMR6_1_GOvf_IrqHandler(void);
void TMR6_1_GUdf_IrqHandler(void);
void TMR6_1_Gdte_IrqHandler(void);
void TMR6_1_SCmpUpA_IrqHandler(void);
void TMR6_1_SCmpDownA_IrqHandler(void);
void TMR6_1_SCmpUpB_IrqHandler(void);
void TMR6_1_SCmpDownB_IrqHandler(void);
void TMR6_2_GCmpA_IrqHandler(void);
void TMR6_2_GCmpB_IrqHandler(void);
void TMR6_2_GCmpC_IrqHandler(void);
void TMR6_2_GCmpD_IrqHandler(void);
void TMR6_2_GCmpE_IrqHandler(void);
void TMR6_2_GCmpF_IrqHandler(void);
void TMR6_2_GOvf_IrqHandler(void);
void TMR6_2_GUdf_IrqHandler(void);
void TMR6_2_Gdte_IrqHandler(void);
void TMR6_2_SCmpUpA_IrqHandler(void);
void TMR6_2_SCmpDownA_IrqHandler(void);
void TMR6_2_SCmpUpB_IrqHandler(void);
void TMR6_2_SCmpDownB_IrqHandler(void);
void TMR6_3_GCmpA_IrqHandler(void);
void TMR6_3_GCmpB_IrqHandler(void);
void TMR6_3_GCmpC_IrqHandler(void);
void TMR6_3_GCmpD_IrqHandler(void);
void TMR6_3_GCmpE_IrqHandler(void);
void TMR6_3_GCmpF_IrqHandler(void);
void TMR6_3_GOvf_IrqHandler(void);
void TMR6_3_GUdf_IrqHandler(void);
void TMR6_3_Gdte_IrqHandler(void);
void TMR6_3_SCmpUpA_IrqHandler(void);
void TMR6_3_SCmpDownA_IrqHandler(void);
void TMR6_3_SCmpUpB_IrqHandler(void);
void TMR6_3_SCmpDownB_IrqHandler(void);
void TMR6_4_GCmpA_IrqHandler(void);
void TMR6_4_GCmpB_IrqHandler(void);
void TMR6_4_GCmpC_IrqHandler(void);
void TMR6_4_GCmpD_IrqHandler(void);
void TMR6_4_GCmpE_IrqHandler(void);
void TMR6_4_GCmpF_IrqHandler(void);
void TMR6_4_GOvf_IrqHandler(void);
void TMR6_4_GUdf_IrqHandler(void);
void TMR6_4_Gdte_IrqHandler(void);
void TMR6_4_SCmpUpA_IrqHandler(void);
void TMR6_4_SCmpDownA_IrqHandler(void);
void TMR6_4_SCmpUpB_IrqHandler(void);
void TMR6_4_SCmpDownB_IrqHandler(void);
void TMR6_5_GCmpA_IrqHandler(void);
void TMR6_5_GCmpB_IrqHandler(void);
void TMR6_5_GCmpC_IrqHandler(void);
void TMR6_5_GCmpD_IrqHandler(void);
void TMR6_5_GCmpE_IrqHandler(void);
void TMR6_5_GCmpF_IrqHandler(void);
void TMR6_5_GOvf_IrqHandler(void);
void TMR6_5_GUdf_IrqHandler(void);
void TMR6_5_Gdte_IrqHandler(void);
void TMR6_5_SCmpUpA_IrqHandler(void);
void TMR6_5_SCmpDownA_IrqHandler(void);
void TMR6_5_SCmpUpB_IrqHandler(void);
void TMR6_5_SCmpDownB_IrqHandler(void);
void TMR6_6_GCmpA_IrqHandler(void);
void TMR6_6_GCmpB_IrqHandler(void);
void TMR6_6_GCmpC_IrqHandler(void);
void TMR6_6_GCmpD_IrqHandler(void);
void TMR6_6_GCmpE_IrqHandler(void);
void TMR6_6_GCmpF_IrqHandler(void);
void TMR6_6_GOvf_IrqHandler(void);
void TMR6_6_GUdf_IrqHandler(void);
void TMR6_6_Gdte_IrqHandler(void);
void TMR6_6_SCmpUpA_IrqHandler(void);
void TMR6_6_SCmpDownA_IrqHandler(void);
void TMR6_6_SCmpUpB_IrqHandler(void);
void TMR6_6_SCmpDownB_IrqHandler(void);
void TMR6_7_GCmpA_IrqHandler(void);
void TMR6_7_GCmpB_IrqHandler(void);
void TMR6_7_GCmpC_IrqHandler(void);
void TMR6_7_GCmpD_IrqHandler(void);
void TMR6_7_GCmpE_IrqHandler(void);
void TMR6_7_GCmpF_IrqHandler(void);
void TMR6_7_GOvf_IrqHandler(void);
void TMR6_7_GUdf_IrqHandler(void);
void TMR6_7_Gdte_IrqHandler(void);
void TMR6_7_SCmpUpA_IrqHandler(void);
void TMR6_7_SCmpDownA_IrqHandler(void);
void TMR6_7_SCmpUpB_IrqHandler(void);
void TMR6_7_SCmpDownB_IrqHandler(void);
void TMR6_8_GCmpA_IrqHandler(void);
void TMR6_8_GCmpB_IrqHandler(void);
void TMR6_8_GCmpC_IrqHandler(void);
void TMR6_8_GCmpD_IrqHandler(void);
void TMR6_8_GCmpE_IrqHandler(void);
void TMR6_8_GCmpF_IrqHandler(void);
void TMR6_8_GOvf_IrqHandler(void);
void TMR6_8_GUdf_IrqHandler(void);
void TMR6_8_Gdte_IrqHandler(void);
void TMR6_8_SCmpUpA_IrqHandler(void);
void TMR6_8_SCmpDownA_IrqHandler(void);
void TMR6_8_SCmpUpB_IrqHandler(void);
void TMR6_8_SCmpDownB_IrqHandler(void);
void TMR4_1_GCmpUH_IrqHandler(void);
void TMR4_1_GCmpUL_IrqHandler(void);
void TMR4_1_GCmpVH_IrqHandler(void);
void TMR4_1_GCmpVL_IrqHandler(void);
void TMR4_1_GCmpWH_IrqHandler(void);
void TMR4_1_GCmpWL_IrqHandler(void);
void TMR4_1_Ovf_IrqHandler(void);
void TMR4_1_Udf_IrqHandler(void);
void TMR4_1_ReloadU_IrqHandler(void);
void TMR4_1_ReloadV_IrqHandler(void);
void TMR4_1_ReloadW_IrqHandler(void);
void TMR4_2_GCmpUH_IrqHandler(void);
void TMR4_2_GCmpUL_IrqHandler(void);
void TMR4_2_GCmpVH_IrqHandler(void);
void TMR4_2_GCmpVL_IrqHandler(void);
void TMR4_2_GCmpWH_IrqHandler(void);
void TMR4_2_GCmpWL_IrqHandler(void);
void TMR4_2_Ovf_IrqHandler(void);
void TMR4_2_Udf_IrqHandler(void);
void TMR4_2_ReloadU_IrqHandler(void);
void TMR4_2_ReloadV_IrqHandler(void);
void TMR4_2_ReloadW_IrqHandler(void);
void TMR4_3_GCmpUH_IrqHandler(void);
void TMR4_3_GCmpUL_IrqHandler(void);
void TMR4_3_GCmpVH_IrqHandler(void);
void TMR4_3_GCmpVL_IrqHandler(void);
void TMR4_3_GCmpWH_IrqHandler(void);
void TMR4_3_GCmpWL_IrqHandler(void);
void TMR4_3_Ovf_IrqHandler(void);
void TMR4_3_Udf_IrqHandler(void);
void TMR4_3_ReloadU_IrqHandler(void);
void TMR4_3_ReloadV_IrqHandler(void);
void TMR4_3_ReloadW_IrqHandler(void);
void TMRA_1_Ovf_IrqHandler(void);
void TMRA_1_Udf_IrqHandler(void);
void TMRA_1_Cmp1_IrqHandler(void);
void TMRA_1_Cmp2_IrqHandler(void);
void TMRA_1_Cmp3_IrqHandler(void);
void TMRA_1_Cmp4_IrqHandler(void);
void TMRA_2_Ovf_IrqHandler(void);
void TMRA_2_Udf_IrqHandler(void);
void TMRA_2_Cmp1_IrqHandler(void);
void TMRA_2_Cmp2_IrqHandler(void);
void TMRA_2_Cmp3_IrqHandler(void);
void TMRA_2_Cmp4_IrqHandler(void);
void TMRA_3_Ovf_IrqHandler(void);
void TMRA_3_Udf_IrqHandler(void);
void TMRA_3_Cmp1_IrqHandler(void);
void TMRA_3_Cmp2_IrqHandler(void);
void TMRA_3_Cmp3_IrqHandler(void);
void TMRA_3_Cmp4_IrqHandler(void);
void TMRA_4_Ovf_IrqHandler(void);
void TMRA_4_Udf_IrqHandler(void);
void TMRA_4_Cmp1_IrqHandler(void);
void TMRA_4_Cmp2_IrqHandler(void);
void TMRA_4_Cmp3_IrqHandler(void);
void TMRA_4_Cmp4_IrqHandler(void);
void TMRA_5_Ovf_IrqHandler(void);
void TMRA_5_Udf_IrqHandler(void);
void TMRA_5_Cmp1_IrqHandler(void);
void TMRA_5_Cmp2_IrqHandler(void);
void TMRA_5_Cmp3_IrqHandler(void);
void TMRA_5_Cmp4_IrqHandler(void);
void TMRA_6_Ovf_IrqHandler(void);
void TMRA_6_Udf_IrqHandler(void);
void TMRA_6_Cmp1_IrqHandler(void);
void TMRA_6_Cmp2_IrqHandler(void);
void TMRA_6_Cmp3_IrqHandler(void);
void TMRA_6_Cmp4_IrqHandler(void);
void TMRA_7_Ovf_IrqHandler(void);
void TMRA_7_Udf_IrqHandler(void);
void TMRA_7_Cmp1_IrqHandler(void);
void TMRA_7_Cmp2_IrqHandler(void);
void TMRA_7_Cmp3_IrqHandler(void);
void TMRA_7_Cmp4_IrqHandler(void);
void TMRA_8_Ovf_IrqHandler(void);
void TMRA_8_Udf_IrqHandler(void);
void TMRA_8_Cmp1_IrqHandler(void);
void TMRA_8_Cmp2_IrqHandler(void);
void TMRA_8_Cmp3_IrqHandler(void);
void TMRA_8_Cmp4_IrqHandler(void);
void TMRA_9_Ovf_IrqHandler(void);
void TMRA_9_Udf_IrqHandler(void);
void TMRA_9_Cmp1_IrqHandler(void);
void TMRA_9_Cmp2_IrqHandler(void);
void TMRA_9_Cmp3_IrqHandler(void);
void TMRA_9_Cmp4_IrqHandler(void);
void TMRA_10_Ovf_IrqHandler(void);
void TMRA_10_Udf_IrqHandler(void);
void TMRA_10_Cmp1_IrqHandler(void);
void TMRA_10_Cmp2_IrqHandler(void);
void TMRA_10_Cmp3_IrqHandler(void);
void TMRA_10_Cmp4_IrqHandler(void);
void TMRA_11_Ovf_IrqHandler(void);
void TMRA_11_Udf_IrqHandler(void);
void TMRA_11_Cmp1_IrqHandler(void);
void TMRA_11_Cmp2_IrqHandler(void);
void TMRA_11_Cmp3_IrqHandler(void);
void TMRA_11_Cmp4_IrqHandler(void);
void TMRA_12_Ovf_IrqHandler(void);
void TMRA_12_Udf_IrqHandler(void);
void TMRA_12_Cmp1_IrqHandler(void);
void TMRA_12_Cmp2_IrqHandler(void);
void TMRA_12_Cmp3_IrqHandler(void);
void TMRA_12_Cmp4_IrqHandler(void);
void EMB_GR0_IrqHandler(void);
void EMB_GR1_IrqHandler(void);
void EMB_GR2_IrqHandler(void);
void EMB_GR3_IrqHandler(void);
void EMB_GR4_IrqHandler(void);
void EMB_GR5_IrqHandler(void);
void EMB_GR6_IrqHandler(void);
void USART_1_RxErr_IrqHandler(void);
void USART_1_RxEnd_IrqHandler(void);
void USART_1_TxEmpty_IrqHandler(void);
void USART_1_TxEnd_IrqHandler(void);
void USART_1_RxTO_IrqHandler(void);
void USART_2_RxErr_IrqHandler(void);
void USART_2_RxEnd_IrqHandler(void);
void USART_2_TxEmpty_IrqHandler(void);
void USART_2_TxEnd_IrqHandler(void);
void USART_2_RxTO_IrqHandler(void);
void USART_3_RxErr_IrqHandler(void);
void USART_3_RxEnd_IrqHandler(void);
void USART_3_TxEmpty_IrqHandler(void);
void USART_3_TxEnd_IrqHandler(void);
void USART_4_RxErr_IrqHandler(void);
void USART_4_RxEnd_IrqHandler(void);
void USART_4_TxEmpty_IrqHandler(void);
void USART_4_TxEnd_IrqHandler(void);
void USART_5_LinBreakField_IrqHandler(void);
void USART_5_LinWakeup_IrqHandler(void);
void USART_5_RxErr_IrqHandler(void);
void USART_5_RxEnd_IrqHandler(void);
void USART_5_TxEmpty_IrqHandler(void);
void USART_5_TxEnd_IrqHandler(void);
void USART_6_RxErr_IrqHandler(void);
void USART_6_RxEnd_IrqHandler(void);
void USART_6_TxEmpty_IrqHandler(void);
void USART_6_TxEnd_IrqHandler(void);
void USART_6_RxTO_IrqHandler(void);
void USART_7_RxErr_IrqHandler(void);
void USART_7_RxEnd_IrqHandler(void);
void USART_7_TxEmpty_IrqHandler(void);
void USART_7_TxEnd_IrqHandler(void);
void USART_7_RxTO_IrqHandler(void);
void USART_8_RxErr_IrqHandler(void);
void USART_8_RxEnd_IrqHandler(void);
void USART_8_TxEmpty_IrqHandler(void);
void USART_8_TxEnd_IrqHandler(void);
void USART_9_RxErr_IrqHandler(void);
void USART_9_RxEnd_IrqHandler(void);
void USART_9_TxEmpty_IrqHandler(void);
void USART_9_TxEnd_IrqHandler(void);
void USART_10_LinBreakField_IrqHandler(void);
void USART_10_LinWakeup_IrqHandler(void);
void USART_10_RxErr_IrqHandler(void);
void USART_10_RxEnd_IrqHandler(void);
void USART_10_TxEmpty_IrqHandler(void);
void USART_10_TxEnd_IrqHandler(void);
void SPI_1_RxEnd_IrqHandler(void);
void SPI_1_TxEmpty_IrqHandler(void);
void SPI_1_Err_IrqHandler(void);
void SPI_1_Idle_IrqHandler(void);
void SPI_2_RxEnd_IrqHandler(void);
void SPI_2_TxEmpty_IrqHandler(void);
void SPI_2_Err_IrqHandler(void);
void SPI_2_Idle_IrqHandler(void);
void SPI_3_RxEnd_IrqHandler(void);
void SPI_3_TxEmpty_IrqHandler(void);
void SPI_3_Err_IrqHandler(void);
void SPI_3_Idle_IrqHandler(void);
void SPI_4_RxEnd_IrqHandler(void);
void SPI_4_TxEmpty_IrqHandler(void);
void SPI_4_Err_IrqHandler(void);
void SPI_4_Idle_IrqHandler(void);
void SPI_5_RxEnd_IrqHandler(void);
void SPI_5_TxEmpty_IrqHandler(void);
void SPI_5_Err_IrqHandler(void);
void SPI_5_Idle_IrqHandler(void);
void SPI_6_RxEnd_IrqHandler(void);
void SPI_6_TxEmpty_IrqHandler(void);
void SPI_6_Err_IrqHandler(void);
void SPI_6_Idle_IrqHandler(void);
void CAN_1_IrqHandler(void);
void CAN_2_IrqHandler(void);
void I2S_1_Tx_IrqHandler(void);
void I2S_1_Rx_IrqHandler(void);
void I2S_1_Err_IrqHandler(void);
void I2S_2_Tx_IrqHandler(void);
void I2S_2_Rx_IrqHandler(void);
void I2S_2_Err_IrqHandler(void);
void I2S_3_Tx_IrqHandler(void);
void I2S_3_Rx_IrqHandler(void);
void I2S_3_Err_IrqHandler(void);
void I2S_4_Tx_IrqHandler(void);
void I2S_4_Rx_IrqHandler(void);
void I2S_4_Err_IrqHandler(void);
void USBFS_Global_IrqHandler(void);
void SDIOC_1_Normal_IrqHandler(void);
void SDIOC_1_Error_IrqHandler(void);
void SDIOC_2_Normal_IrqHandler(void);
void SDIOC_2_Error_IrqHandler(void);
void ETH_Global_IrqHandler(void);
void ETH_Wakeup_IrqHandler(void);
void I2C_1_RxEnd_IrqHandler(void);
void I2C_1_TxEnd_IrqHandler(void);
void I2C_1_TxEmpty_IrqHandler(void);
void I2C_1_Err_IrqHandler(void);
void I2C_2_RxEnd_IrqHandler(void);
void I2C_2_TxEnd_IrqHandler(void);
void I2C_2_TxEmpty_IrqHandler(void);
void I2C_2_Err_IrqHandler(void);
void I2C_3_RxEnd_IrqHandler(void);
void I2C_3_TxEnd_IrqHandler(void);
void I2C_3_TxEmpty_IrqHandler(void);
void I2C_3_Err_IrqHandler(void);
void I2C_4_RxEnd_IrqHandler(void);
void I2C_4_TxEnd_IrqHandler(void);
void I2C_4_TxEmpty_IrqHandler(void);
void I2C_4_Err_IrqHandler(void);
void I2C_5_RxEnd_IrqHandler(void);
void I2C_5_TxEnd_IrqHandler(void);
void I2C_5_TxEmpty_IrqHandler(void);
void I2C_5_Err_IrqHandler(void);
void I2C_6_RxEnd_IrqHandler(void);
void I2C_6_TxEnd_IrqHandler(void);
void I2C_6_TxEmpty_IrqHandler(void);
void I2C_6_Err_IrqHandler(void);
void PWC_Pvd1_IrqHandler(void);
void PWC_Pvd2_IrqHandler(void);
void FCM_Err_IrqHandler(void);
void FCM_End_IrqHandler(void);
void FCM_Ovf_IrqHandler(void);
void CTC_Udf_IrqHandler(void);
void CTC_Ovf_IrqHandler(void);
void ADC_1_SeqA_IrqHandler(void);
void ADC_1_SeqB_IrqHandler(void);
void ADC_1_Cmp0_IrqHandler(void);
void ADC_1_Cmp1Ind_IrqHandler(void);
void ADC_1_Cmp1Comb_IrqHandler(void);
void ADC_2_SeqA_IrqHandler(void);
void ADC_2_SeqB_IrqHandler(void);
void ADC_2_Cmp0_IrqHandler(void);
void ADC_2_Cmp1Ind_IrqHandler(void);
void ADC_2_Cmp1Comb_IrqHandler(void);
void ADC_3_SeqA_IrqHandler(void);
void ADC_3_SeqB_IrqHandler(void);
void ADC_3_Cmp0_IrqHandler(void);
void ADC_3_Cmp1Ind_IrqHandler(void);
void ADC_3_Cmp1Comb_IrqHandler(void);
void NFC_IrqHandler(void);

/**
 * @}
 */

#endif /* DDL_INTERRUPTS_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_INTERRUPTS_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
